#  Week 2

## Chi squared  ANALYSIS OF Gapminder data

## Importing data

In [9]:
import numpy as np
import pandas as pd
import scipy.stats as sp

In [2]:
data = pd.read_csv("gapminder.csv")

##  Data management--

In [3]:

def fun(a):
    for i in range(len(a)):
        if a[i] == " ":
            a[i] = np.nan
        else :
            a[i] = float(a[i])

In [4]:
data1 = data.iloc[:,[0,1,2,9,14]].copy()

In [5]:
data1.head()

,country,incomeperperson,alcconsumption,lifeexpectancy,employrate
0,Afghanistan,,.03,48.673,55.7000007629394
1,Albania,1914.99655094922,7.29,76.918,51.4000015258789
2,Algeria,2231.99333515006,.69,73.131,50.5
3,Andorra,21943.3398976022,10.17,,
4,Angola,1381.00426770244,5.57,51.093,75.6999969482422

In [6]:
data1.columns = ["country","income","alcohol","life","employment"]

In [10]:
for i in data1.columns[1:]:
    fun(data1[i])

In [14]:
def fun2(a):
    
    x = np.mean(a.dropna())
    for i in range(len(a)):
        if np.isnan(a[i]):
            a[i] = x

In [17]:
for i in data1.columns[1:]:
    fun2(data1[i])

In [18]:
data1.head()

       country   income alcohol     life employment
0  Afghanistan  8740.97    0.03   48.673       55.7
1      Albania     1915    7.29   76.918       51.4
2      Algeria  2231.99    0.69   73.131       50.5
3      Andorra  21943.3   10.17  69.7535     58.636
4       Angola     1381    5.57   51.093       75.7

###  missing values were replaced by the mean of their columns and no rows were deleted

# Chi squared ANALYSIS

## For post hoc analysis we need to categorical variable so we will convert income and life as categorical varaiables

In [19]:
data2 = data1.iloc[:,[1,3]].copy()

In [21]:
def fun3(a):
    print(np.percentile(a,33))
    print(np.percentile(a,66))

In [23]:
fun3(data2["income"])

1618.088252785783
8740.966076259434

In [24]:
def fun4(a):
    if a<1618:
        return 0
    elif a<8740.9:
        return 1
    else :
        return 2

In [25]:
data2["inc"] = list(map(fun4,data2["income"]))

In [26]:
print(np.percentile(data2["life"],50))

72.231

In [27]:
def fun5(a):
    if a>72:
        return 1
    else:
        return 0

In [28]:
data2["life_categ"] = list(map(fun5,data2["life"]))

In [29]:
data2

      income     life  inc  life_categ
0    8740.97   48.673    2           0
1       1915   76.918    1           1
2    2231.99   73.131    1           1
3    21943.3  69.7535    2           0
4       1381   51.093    0           0
..       ...      ...  ...         ...
208  722.808   75.181    0           1
209  8740.97   72.832    2           1
210  610.357   65.493    0           0
211  432.226   49.025    0           0
212  320.772   51.384    0           0

[213 rows x 4 columns]

In [30]:
data2["inc"] = data2["inc"].astype("category")
data2["life_categ"] = data2["life_categ"].astype("category")

In [31]:
data3 = data2.iloc[:,2:].copy()

both the variables have been converted to category and in life_categ 1 represents if the person lives more than 70's and 0 if not while in income 0 means low income 1 means moderate income and 2 means hogh income

# chi squared analysis

Null hypothesis show - no relation of chances of dying after 72 and income

Alternate Hypothesis - chances of dying after 72 and income are related

In [52]:
mt = pd.crosstab(data3["inc"],data3["life_categ"])

In [53]:
mt

life_categ   0   1
inc
0           62   8
1           20  49
2           22  52

In [54]:
colsum = mt.sum(axis=0)

In [57]:
colsum

life_categ
0    104
1    109
dtype: int64

In [55]:
mt = mt/colsum

In [56]:
mt

life_categ         0         1
inc
0           0.596154  0.073394
1           0.192308  0.449541
2           0.211538  0.477064

In [58]:
res1 = sp.chi2_contingency(mt)

In [60]:
print(res1)

(0.613630134972943, 0.7357866592023713, 2, array([[0.33477417, 0.33477417],
       [0.32092449, 0.32092449],
       [0.34430134, 0.34430134]]))

P Value = 0.735 is pretty high and value of chi squared value is pretty low so we can not reject null hypothesis hence we can say

# life expectancy and income per person of a country is not related

# Summary

For the test first i converted life expectancy and income into categorical variables since chi squared test requires it to be so .My chi squared test showed that life expectancy and income are not related at all hence no post hoc analysis was required.